{"title": " The Surfer's Muse", "desired_pages": 100, "chapter_length": 10, "num_chapters": 10, "raw_outline": " Here is a 5000 word outline for a 100-page fiction novel in the style of Olivia Cunning:\n\nPlot:\nThe story follows Chloe, a free-spirited 25-year-old  photographer who is struggling to get her business off the ground in Chicago. At the beginning of the story, Chloe loses her biggest client and is on the verge of going out of business. As a last-ditch effort, she decides to take a 2-week vacation to Hawaii to find inspiration for new photos to build her portfolio.   \nIn Maui, Chloe meets Kai, a handsome 35-year-old  professional surfer and owner of a popular surfing school. Kai is instantly attracted to Chloe's beauty, passion for life, and carefree attitude. However, Kai avoids committed relationships due to a troubled past. They have an intense chemistry and share a steamy one-night stand, then continue to cross paths during Chloe's trip.\nEventually, Chloe's photos of Kai surfing go viral, launching her career. She is offered a opportunity by a major surfwear company to travel around the world taking photos. At first, Chloe turns it down, not wanting to leave Kai. But Kai encourages her to follow her dreams, even if it means losing him.\nChloe goes off on the surfing photo tour. She and Kai try to maintain a long-distance relationship, but struggle with lack of trust and commitment issues. Chloe's career takes off but she realizes she's not happy without Kai. She returns to Maui to win Kai back, but he rejects her, still afraid of commitment.\nChloe is heartbroken but knows she must let Kai go. She channels her pain into her photography. Her work gains more acclaim and connections in the surfing world. Four years later,she and Kai cross paths at a surfing competition she is photographing.  Sparks reignite and Kai realizes how much he still loves Chloe. He asks for a second chance, finally ready to commit to her and face his past. After some hesitation, Chloe forgives Kai. They reunite, ready to  build a future together with a solid foundation of trust, love and understanding.\n\nCharacters:\nChloe: 25-year-old fiery, passionate and free-spirited photographer. Struggles with her career but finds inspiration in Hawaii. Forms an intense connection with Kai but has her heart broken when he's unable to commit. Through hardship, Chloe finds her own strength and independence which eventually leads her back to Kai.", "plot_outline": " Here is the plot of the story based on your outline:\n\nChloe is a 25-year-old photographer struggling to establish her business in Chicago. She loses her biggest client and is nearly bankrupt. As a last hope, she takes a 2-week vacation to Hawaii to find inspiration for new photos.\n\nIn Maui, Chloe meets Kai, a 35-year-old professional surfer who runs a surfing school. Kai is instantly attracted to Chloe but avoids relationships due to past issues. They share a passionate night together and continue running into each other during Chloe's trip. \n\nChloe's photos of Kai surfing go viral, launching her career. A surfwear company offers her a chance to travel and photograph surfing around the world. Though Chloe wants to stay with Kai, he encourages her to follow this opportunity.\n\nChloe's career takes off, but she's unhappy without Kai. She returns to Maui to win him back, but he rejects her, afraid of commitment.\n\nHeartbroken, Chloe channels her pain into her work. She gains more success and connections in the surfing world. Four years later, she and Kai meet at a surfing event she's photographing. Their chemistry reignites, and Kai realizes he still loves Chloe. He asks for another chance, now ready to commit. After hesitating, Chloe forgives Kai. They reunite, building a future based on trust, love and understanding.", "chapter_by_chapter_summary_string": "", "chapter_summary_array": [], "filename": " The Surfer's Muse", "full_text": [], "page_summaries": [], "model": {"name": "gpt-4-0314", "token_limit": 8000}, "pad_amount": 500}